Учет_кабельной_продукции/src/Documents/ЗаявкиНаЗакупки/ЗаявкиНаЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиНаЗакупки</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ДанныеПоЗаявкамНаЗакупку</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>299</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВКНаКПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>299</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/Documents/ЗаявкиНаЗакупки/ManagerModule.bsl
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;	
	Результат.Добавить("Статус;ФормаЗаписать,ФормаПрикрепитьСканДокумента");
	Результат.Добавить("НомерДокумента");
	Результат.Добавить("ДатаДокумента");
	Результат.Добавить("Подрядчик");
	Результат.Добавить("КабельныеЛинии");
	Возврат Результат;
	
КонецФункции
